[
    {
        "_id": "635717f7ac653df78d3ec1dc",
        "category_id": "01",
        "rating": "$4.4",
        "total_student": 553,
        "title": "Learn the Basic of Python",
        "lessons": "10 lessons",
        "lectures": "36 lectures",
        "durations": "3 months",
        "time": "56 hours",
        "language": "English",
        "requirement": [
            "Basic math skills",
            "Have a computer (either Mac, Windows, or Linux)",
            "Desire to learn!",
            "No prior knowledge of Python is required",
            "No previous programming experience is needed",
            "Prepare to fall in love with Python and programming!"
        ],
        "like": {
            "name": "Angel Rhodes",
            "total_likes": 89
        },
        "teacher": {
            "name": "Hinton Noble",
            "author_img": "https://randomuser.me/api/portraits/men/79.jpg",
            "last_updated": "2015-07-18",
            "instructor_rating": "4.6 Instructor Rating",
            "instructor_review": "227,165 Reviews",
            "students": "883,215 Students",
            "courses": "25 Courses",
            "about": "Hinton Noble is the instructor of some of the highest rated programming and technical courses online and is the founder of ZTM Academy known for having some of the best instructors and tech education in the world. His graduates have moved on to work for some of the biggest tech companies around the world like Apple, Google, Tesla, Amazon, JP Morgan, IBM, UNIQLO etc... He has been working as a senior software developer in Silicon Valley and Toronto for many years, and is now taking all that he has learned, to teach programming skills and to help you discover the amazing career opportunities that being a developer allows in life."

        },
        "price": "$131.00",
        "image_url": "https://i.ibb.co/thPvmLS/python-card.jpg",
        "thumbnail_url": "https://i.ibb.co/vQPBrGT/py2.jpg",
        "short_details": "Master Python by building 100 projects in 100 days. Learn data science, automation, build websites, games and apps!",
        "overview": [
            "Become a professional Python Developer and get hired",
            "Master modern Python 3.10(latest) fundamentals as well as advanced topics\n",
            "Learn Object Oriented Programming",
            "Learn Function Programming"
        ],
        "details": "By the end of this course, you will be a complete Python developer that can get hired at large companies. We are going to use Python to work with Email, Text Messages, CSV files, PDF files, Image Files, Data Visualizations, build our own machine learning model and perform Image detection. We are going to build a web scraper for HackerNews, build a Twitter bot,  build the most secure password checker and we will also build some automation tools using Selenium. But the best part? We will build an actual portfolio website using Python that your future employer and customers can contact you at. By the end, you will have a stack of projects you have built that you can show off to others."
    },
    {
        "_id": "635717f74b8b18f26fad8c77",
        "category_id": "01",
        "rating": "$5.0",
        "total_student": 638,
        "title": "Introduction to Object Oriented Programing",
        "lessons": "8 lessons",
        "lectures": "42 lectures",
        "durations": "4 months",
        "time": "59 hours",
        "language": "English",
        "requirement": [
            "No previous programming knowledge is required",
            "All the tools needed are free to install",
            "Willingness to learn",
            "No prior knowledge of Java is required",
            "No previous programming experience is needed",
            "Prepare to fall in love with Python and programming!"
        ],
        "like": {
            "name": "Liz Morrison",
            "total_likes": 81
        },
        "teacher": {
            "name": "Marisol Pena",
            "author_img": "https://randomuser.me/api/portraits/men/85.jpg",
            "last_updated": "2021-10-12",
            "instructor_rating": "4.7 Instructor Rating",
            "instructor_review": "201,165 Reviews",
            "students": "582,205 Students",
            "courses": "18 Courses",
            "about": "Marisol Pena is a professional learning academy that teaches programming at a professional level by experienced and certified software developers. The Marisol Pena Academy has already taught programming to thousands of students around the world, and many of the students got their first programming jobs after going through our courses.Would you like to be the next one?  Come join us, we are waiting for you!"
        },
        "price": "$94.19",
        "image_url": "https://i.ibb.co/bvRnZw9/java2.jpg",
        "thumbnail_url": "https://i.ibb.co/hC7JDjc/java-card.jpg",
        "short_details": "Learn Java In This Course And Become a Computer Programmer. Obtain valuable Core Java Skills And Java Certification",
        "overview": [
            "Be able to program in Java professionally",
            "Get hands-on experience and solve 100+ coding exercises.",
            "Learn Java best practices from a professional developer.",
            "Become proficient in Java 11."
        ],
        "details": "This course begins by giving a birds-eye view of Java covering everything from origin of Java to installing Java and writing your first Java program. Even the most fundamental concepts like compilation & interpretation are explained. All other topics are covered in-depth starting from language basics, object-oriented concepts & design, JVM internals, exceptions, IO, collections framework, generics, multi-threading, databases, nested classes, enums, and functional-style programming via Java 8 constructs like lambdas & streams. You'll also learn about database designing, implementation (SQL), and how to interact with them from Java programs (via JDBC). The course also gives a very good introduction to Java EE technologies like JSP, Servlets and JSTL, which help in project implementation. Finally, an excellent Eclipse IDE tutorial is also included, which teaches you how to use Eclipse professionally for effectively writing, debugging and even testing Java programs using the JUnit framework.Each lecture has been very carefully crafted explaining the motivation behind every concept. Each concept is clearly explained with well thought out examples & illustrations and is demonstrated in code. Object-oriented concepts like inheritance & polymorphism are explained through a real-world case-study, which is also implemented as part of the course project. Several challenging coding exercises & quizzes are included to reinforce what you've learned. Your solutions for coding exercises are also auto-evaluated to help you instantly know whether or not the solution is correct."
    },
    {
        "_id": "635717f79a4c64ec8c5a995f",
        "category_id": "01",
        "rating": "$4.6",
        "total_student": 697,
        "title": "JavaScript - The Complete Guide",
        "lessons": "11 lessons",
        "lectures": "26 lectures",
        "durations": "3 months",
        "time": "39 hours",
        "language": "English",
        "requirement": [
            "No coding experience is necessary to take this course! I take you from beginner to expert!",
            "Any computer and OS will work — Windows, macOS or Linux. We will set up your text editor the course.",
            "Desire to learn!",
            "A basic understanding of HTML and CSS is a plus, but not a must! The course includes an HTML and CSS crash course."
        ],

        "like": {
            "name": "Sheryl Sanchez",
            "total_likes": 94
        },
        "teacher": {
            "name": "Earlene Pittman",
            "author_img": "https://randomuser.me/api/portraits/men/11.jpg",
            "last_updated": "2019-09-27",
            "instructor_rating": "4.8 Instructor Rating",
            "instructor_review": "19,125 Reviews",
            "students": "278,218 Students",
            "courses": "28 Courses",
            "about": "I'm a full-stack web developer and designer with a passion for building beautiful things from scratch. I've been building websites and apps since 2010 and also have a Master's degree in Engineering. I discovered my passion for teaching and helping others by sharing all I knew when I was in college, and that passion brought me to Online Study. Here, in all my courses, what students love the most is that I take the time to explain every concept in a way that everyone can easily understand."
        },
        "price": "$85.83",
        "image_url": "https://i.ibb.co/1RNprKW/js2.jpg",
        "thumbnail_url": "https://i.ibb.co/D4WzRZs/js1.jpg",
        "short_details": "Modern JavaScript from the beginning - all the way up to JS expert level! THE must-have JavaScript resource in 2022.",
        "overview": [
            "Learn JavaScript from scratch and in great detail - from beginner to advanced",
            "All core features and concepts you need to know in modern JavaScript development",
            "Everything you need to become a JavaScript expert and apply for JavaScript jobs",
            "Project-driven learning with plenty of examples"
        ],
        "details": "This is the most comprehensive and modern course you can find on JavaScript - it's based on all my JavaScript knowledge AND teaching experience. It's both a complete guide, starting with the core basics of the language, as well as an extensive reference of the JavaScript language and environment, ensuring that both newcomers as well as experienced JavaScript developers get a lot out of this course!It's a huge course because it's packed with important knowledge and helpful content. From the core basics, over advanced concepts and JavaScript specialties, all the way up to expert topics like performance optimization and testing - this course has it all. My goal was to create your go-to resource for the JavaScript language, which you can not just use for learning it but also as a resource you can come back to and look up important topics."
    },
    {
        "_id": "635717f7a99bfaaa971470c7",
        "category_id": "01",
        "rating": "$4.1",
        "total_student": 514,
        "title": "Beginning C++ Programming",
        "lessons": "8 lessons",
        "lectures": "46 lectures",
        "durations": "4 months",
        "time": "42 hours",
        "language": "Bangla, English",
        "requirement": [
            "Access to a computer running Windows, Mac OS X or Linux",
            "Desire to learn!",
            "No prior knowledge of C++ is required",
            "No previous programming experience is needed",
            "Prepare to fall in love with C++ and programming!"
        ],
        "like": {
            "name": "Sanford Andrews",
            "total_likes": 101
        },
        "teacher": {
            "name": "Florine Gomez",
            "author_img": "https://randomuser.me/api/portraits/men/62.jpg",
            "last_updated": "2019-09-25",
            "instructor_rating": "4.8 Instructor Rating",
            "instructor_review": "16,985 Reviews",
            "students": "568,698 Students",
            "courses": "24 Courses",
            "about": "The Learn Programming Academy was created by Florine Gomez, a software developer with 35 years experience, who is also an instructor on Online Study, with over 1.66M+ students in his courses on Java, Python, Android, C#  and the Spring framework. "
        },
        "price": "$117.18",
        "image_url": "https://i.ibb.co/7C94stZ/c1.jpg",
        "thumbnail_url": "https://i.ibb.co/bz01V6Q/c2.jpg",
        "short_details": "Obtain Modern C++ Object-Oriented Programming (OOP) and STL skills. C++14 and C++17 covered. C++20 info see below.",
        "overview": [
            "Learn to program with one of the most powerful programming languages that exists today, C++.",
            "Obtain the key concepts of programming that will also apply to other programming languages",
            "Learn Modern C++ rather than an obsolete version of C++ that most other courses teach",
            "Learn C++ features from basic to more advanced such as inheritance and polymorphic functions"
        ],
        "details": "Find a good course, taught by an instructor with many years of experience in C++ is critical, as is the need for the instructor to have the necessary skills to be able to teach you the language.Frank Mitropolous, the instructor in this course has been using C++ for over 2 decades and has taught students in both university courses and industry training courses.  He even worked on a C++ compiler development project while he was in the industry.So not only will you be learning C++ from an expert C++ programmer, but you'll also be taught by an instructor who has successfully taught at university level for many years.As a result, you can take this course with confidence, knowing that you will learn C++ the right way, and in the shortest possible timeframe"
    },
    {
        "_id": "635717f7a5440a7459a4ac1c",
        "category_id": "01",
        "rating": "$4.9",
        "total_student": 644,
        "title": "Learn to Code with Ruby",
        "lessons": "6 lessons",
        "lectures": "28 lectures",
        "durations": "2 months",
        "time": "26 hours",
        "language": "English",
        "requirement": [
            "Basic text editing skills",
            "Desire to learn!",
            "Basic computer skills (web browsing, app installation, file navigation)"
        ],
        "like": {
            "name": "Debora Jimenez",
            "total_likes": 82
        },
        "teacher": {
            "name": "Bauer Cline",
            "author_img": "https://randomuser.me/api/portraits/men/37.jpg",
            "last_updated": "2017-07-26",
            "instructor_rating": "4.5 Instructor Rating",
            "instructor_review": "26,585 Reviews",
            "students": "269,608 Students",
            "courses": "25 Courses",
            "about": "Bauer Cline is one of the few knowledgeable instructors that I found here in Online Study. This course is perfect for beginners because it shows you how Ruby works, how to accomplish day to day tasks with Ruby and how you can avoid bugs by understanding the core concepts well. Highly recommended."
        },
        "price": "$123.04",
        "image_url": "https://i.ibb.co/7Nhhjx1/ruby1.jpg",
        "thumbnail_url": "https://i.ibb.co/Bq2NQYZ/ruby2.jpg",
        "short_details": "Learn to make innovative web apps with Ruby on Rails and unleash your creativity",
        "overview": [
            "Learn how to rapidly prototype ideas and turn them into presentable apps",
            "Become a professional web application developer",
            "Become a professional Ruby on Rails developer",
            "Design and build virtually any web application you can imagine"
        ],
        "details": "Since its introduction, Ruby on Rails has rapidly become one of the most popular and powerful web application development tools for both startups and mature software companies. Some of the top sites in the world started with Ruby on Rails such as Basecamp, Twitter, Shopify, Github, LivingSocial, Groupon, Hulu, Airbnb, Yellow Pages and many more! Even after immense scaling, most of them continue to use Rails! Ruby on Rails developers routinely command the highest salaries in the tech industry!"
    },
    {
        "_id": "635717f7a5440ab7459a4ac1c",
        "category_id": "01",
        "rating": "$4.8",
        "total_student": 864,
        "title": "PHP for Beginners",
        "lessons": "7 lessons",
        "lectures": "18 lectures",
        "durations": "2 months",
        "time": "20 hours",
        "language": "English, Bangla",
        "requirement": [
            "Have a computer with Internet",
            "Be ready to learn an insane amount of awesome stuff",
            "Prepare to build real web apps!",
            "Brace yourself for stupid jokes about my dog Rusty"
        ],
        "like": {
            "name": "Mcgowan Rowind",
            "total_likes": 88
        },
        "teacher": {
            "name": "Dave Hollingworth",
            "author_img": "https://randomuser.me/api/portraits/women/65.jpg",
            "last_updated": "2017-07-26",
            "instructor_rating": "4.9 Instructor Rating",
            "instructor_review": "36,985 Reviews",
            "students": "569,808 Students",
            "courses": "29 Courses",
            "about": "Hi! I'm Dave Hollingworth. I'm a developer with a serious love for teaching. I've spent the last few years teaching people to program at 2 different immersive bootcamps where I've helped hundreds of people become web developers and change their lives. My graduates work at companies like Google, Salesforce, and Square.Most recently, I led Galvanize's SF's 6 month immersive program as Lead Instructor and Curriculum Director. After graduating from my class, 94% of my students went on to receive full-time developer roles. I also worked at Udacity as a Senior Course Developer on the web development team where I got to reach thousands of students daily."
        },
        "price": "$123.04",
        "image_url": "https://i.ibb.co/VHDKgDC/php2.jpg",
        "thumbnail_url": "https://i.ibb.co/nnc0VvY/py2.jpg",
        "short_details": "Build a Content Management System from Scratch with PHP and MySQL",
        "overview": [
            "Learn how to create a dynamic website using the most popular website programming language",
            "Learn how to secure your code",
            "Become a professional Ruby on Rails developer",
            "Learn how to write reusable, more maintainable code using programming standards"
        ],
        "details": "You will learn  how to create a dynamic website using the most popular website programming language in the world, PHP. Dave Hollingworth, your instructor will teach you the PHP programming language, and take you through the steps to build a working CMS in PHP and MySQL from scratch. Along the way, you will learn how to secure your code, how to write reusable, more maintainable code using programming standards, and how to structure your code using object-oriented programming techniques. Dave will teach you the theory and then put the theory into practice when building the CMS.You will also learn how to style your site using Bootstrap, how to integrate third-party code into your site, how to store data in a relational database and use this from PHP code, and more.The course is very thorough, and goes through everything from installing a web server on your own computer, and editor to writing the code to create your web app.  Towards the end of the course you will even learn how to upload the code and make your code live on the internet (very useful if you already have your own Hosting account).  This is not necessary to complete the course though."
    }
]